devinschubert14/STM410RB-Drivers/drivers/drivers/Src/stm32f410RB_i2c_driver.c
/*
 * stm43410RB_i2c_driver.c
 *
 *  Created on: Jan 28, 2023
 *      Author: devin
 */
#include "stm32f410RB_i2c_driver.h"


/***********************************************************
 *
 * 				I2C Interrupt Helper Functions
 *
 ***********************************************************/
static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx);
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t slaveAddr);
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t slaveAddr);
static void I2C_ClearADDRFlag(I2C_Handle_t *pI2CHandle);
static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle);
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle);

/* Function Name: I2C_GenerateStartCondition
 * Desc: Generates a start condition on I2C port.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * Return: None
 */
static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx){
	pI2Cx->CR1 |= (1 << I2C_CR1_START);
}

/* Function Name: I2C_GenerateStopCondition
 * Desc: Generates a stop condition on I2C port.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * Return: None
 */
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx){
	pI2Cx->CR1 |= (1 << I2C_CR1_STOP);
}

/* Function Name: I2C_ExecuteAddressPhaseWrite
 * Desc: Sends address on I2C port with write bit.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * 	- slaveAddr: Address of slave
 * Return: None
 */
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t slaveAddr){
	slaveAddr = slaveAddr << 1;
	slaveAddr &= ~(1); //slave address + r/nw bit=0
	pI2Cx->DR = slaveAddr;
}

/* Function Name: I2C_ExecuteAddressPhaseRead
 * Desc: Sends address on I2C port with read bit.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * 	- slaveAddr: Address of slave
 * Return: None
 */
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t slaveAddr){
	slaveAddr = slaveAddr << 1;
	slaveAddr |= 1; //slave address + r/nw bit=1
	pI2Cx->DR = slaveAddr;
}

/* Function Name: I2C_ManageAcking
 * Desc: Enable or Disabe ACKing on I2C port.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * 	- EnOrDi: I2C_ACK_ENABLE/I2C_ACK_DISABLE or 1/0 respectively.
 * Return: None
 */
void I2C_ManageAcking(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi){
	if(EnOrDi == I2C_ACK_ENABLE){
		pI2Cx->CR1 |= (1 << I2C_CR1_ACK);
	}else{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_ACK);
	}
}
/* Function Name: I2C_ClearADDRFlag
 * Desc: Clear ADDR flag in I2C port registers.
 * Params:
 * 	- *pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None
 */
static void I2C_ClearADDRFlag(I2C_Handle_t *pI2CHandle){
	uint32_t dummyRead;
	//check device mode
	if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_MSL)){
		//Master Mode
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX){
			if(pI2CHandle->RxSize == 1){
				//disable ACK
				I2C_ManageAcking(pI2CHandle->pI2Cx, DISABLE);

				dummyRead = pI2CHandle->pI2Cx->SR1;
				dummyRead = pI2CHandle->pI2Cx->SR2;
				(void)dummyRead;
			}
		}
	}
	else{
		//Slave Mode
	}
}
/***********************************************************
 *
 * 				Clock and Peripheral Control Functions
 *
 ***********************************************************/

/* Function Name: I2C_PeriClockControl
 * Desc: Enables or Disables the peripheral clock for the specified I2C port.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * 	- EnOrDi: Enable or disable port by using ENABLE/DISBALE or 0/1.
 * Return: None
 */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if (EnOrDi == ENABLE)
	{
		if (pI2Cx == I2C1)
		{
			I2C1_PCLK_EN();
		}
		else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_EN();
		}
		else if(pI2Cx == I2C4){
			I2C4_PCLK_EN();
		}
	}
	else if (EnOrDi == DISABLE)
	{
		if (pI2Cx == I2C1)
		{
			I2C1_PCLK_DI();
		}
		else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_DI();
		}

		else if(pI2Cx == I2C4){
			I2C4_PCLK_EN();
		}
	}
}
/* Function Name: I2C_PeripheralControl
 * Desc: Enables or Disables the peripheral in control register for the specified I2C port.
 * Params:
 * 	- *pI2Cx: I2C port from @I2C_BASEADDR
 * 	- EnOrDi: Enable or disable port by using ENABLE/DISBALE or 0/1.
 * Return: None
 */
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if (EnOrDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_PE);
	}
	else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
	}
}


/***********************************************************
 *
 * 				Init and De-init Functions
 *
 ***********************************************************/

/* Function Name: I2C_Init
 * Desc: Initialize a I2C port
 * Params: - *pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None
 */
void I2C_Init(I2C_Handle_t *pI2CHandle){
	uint32_t tempreg = 0;

	//enable clock for i2cx peripheral
	I2C_PeriClockControl(pI2CHandle->pI2Cx,ENABLE);

	//ack control bit
	tempreg |= pI2CHandle->I2C_Config.I2C_AckControl << 10;
	pI2CHandle->pI2Cx->CR1 = tempreg;

	//Set FREQ in CR2
	tempreg = 0;
	tempreg = RCC_GetPCLK1Value()/1000000U;
	pI2CHandle->pI2Cx->CR2 = (tempreg & 0x3F);

	//Set devices address
	tempreg = 0;
	tempreg |= pI2CHandle->I2C_Config.I2C_DeviceAddress << 1;
	tempreg |= (1 << 14);
	pI2CHandle->pI2Cx->OAR1 = tempreg;

	//CCR calculations
	uint16_t ccr_value = 0;
	tempreg = 0;
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM){
		//Standard Mode
		ccr_value = (RCC_GetPCLK1Value() / (2 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
		tempreg |= (ccr_value & 0xFFF);
	}else {
		//Fast Mode
		tempreg |= (1 << 15);
		tempreg |= (pI2CHandle->I2C_Config.I2C_FMDutyCycle << 14);
		if(pI2CHandle->I2C_Config.I2C_FMDutyCycle == I2C_FM_DUTY_2)
			ccr_value = (RCC_GetPCLK1Value()/(3 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
		else
			ccr_value = (RCC_GetPCLK1Value()/(25 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
		tempreg |= (ccr_value & 0xFFF);
	}
	pI2CHandle->pI2Cx->CCR = tempreg;

	//TRISE Configuration
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM){
		//Standard Mode
		tempreg = (RCC_GetPCLK1Value()/1000000U) + 1;
	}
	else{
		//Fast Mode
		tempreg = ((RCC_GetPCLK1Value() * 300)/1000000000U) + 1;
	}
	pI2CHandle->pI2Cx->TRISE = (tempreg & 0x3F);
}

