devinschubert14/STM410RB-Drivers/drivers/drivers/Src/stm32f410RB_i2c_driver.c
void I2C_DeInit(I2C_RegDef_t *pI2Cx){
	//disable clock for i2cx peripheral
	I2C_PeriClockControl(pI2Cx,DISABLE);
}


/***********************************************************
 *
 * 				Data Send and Receive
 *
 ***********************************************************/

/******* MASTER *********/

/* Function Name: I2C_MasterSendData
 * Desc: Write to I2C port with provided slave address and data in TxBuffer.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * 	- pTxBuffer: Pointer to a buffer array to read from
 * 	- len: Total bytes to send from pTxBuffer
 * 	- slaveAddr: 7 or 10 bit addresss of slave to send to
 * 	- sr: boolean for if this should be a repeated start
 * Return: None
 */
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr){
	//1. Generate START condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	//2. confirm start generation completed
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_SB));

	//3. Send the address of the slave with r/nw bit set to 1
	I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, slaveAddr);

	//4. Confirm that address phase is complete
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_ADDR));

	//5. Clear the ADDR flag
	I2C_ClearADDRFlag(pI2CHandle);

	//6. send the data until len is 0
	while(len){
		while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_TXE));
		pI2CHandle->pI2Cx->DR = *pTxBuffer;
		pTxBuffer++;
		len--;
	}

	//7. Wait for TXE=1 and BTF=1 before generating STOP condition
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_TXE));
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_BTF));

	//8. Generate STOP condition
	if(sr == I2C_DISABLE_SR)
		I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
}

/* Function Name: I2C_MasterReceiveData
 * Desc: Read from I2C port with provided slave address and to RxBuffer.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * 	- pRxBuffer: Pointer to a buffer array to write to
 * 	- len: Total bytes to write to RxBuffer
 * 	- slaveAddr: 7 or 10 bit addresss of slave to send to
 * 	- sr: boolean for if this should be a repeated start
 * Return: None
 */
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr){
	//1. Generate START condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	//2. confirm START generation completed
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_SB));

	//3. Send the address
	I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, slaveAddr);

	//4. Confirm address phase is complete
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_ADDR));

	//Read one byte
	if(len == 1){
		//Disable ACK
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

		//Clear ADDR flag
		I2C_ClearADDRFlag(pI2CHandle);

		//Wait until RXNE completes
		while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_RXNE));

		//Generate STOP condition
		if(sr == I2C_DISABLE_SR)
			I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

		//Read data
		*pRxBuffer = pI2CHandle->pI2Cx->DR;
	}

	if(len > 1){
		//Clear ADDR flag
		I2C_ClearADDRFlag(pI2CHandle);

		//Read data
		while(len){
			while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_RXNE) );
			if(len == 2){
				//Disable ACK
				I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

				//Generate STOP
				if(sr == I2C_DISABLE_SR)
					I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
			}

			//read data to buffer
			//Read data
			*pRxBuffer = pI2CHandle->pI2Cx->DR;
			pRxBuffer++;
			len--;
		}
	}

	//Enable ACKing

	if(pI2CHandle->I2C_Config.I2C_AckControl == I2C_ACK_ENABLE)
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_ENABLE);
}

/******* SLAVE *********/

void I2C_SlaveSendData(I2C_RegDef_t *pI2Cx,uint8_t data){
	pI2Cx->DR = data;
}
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2Cx){
	return pI2Cx->DR;
}


/***********************************************************
 *
 * 			Interrupt Functions
 *
 ***********************************************************/

/* Function Name: I2C_MasterSendDataIT
 * Desc: Write to I2C port with provided slave address and data in TxBuffer in nonblocking mode.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * 	- pTxBuffer: Pointer to a buffer array to read from
 * 	- len: Total bytes to send from pTxBuffer
 * 	- slaveAddr: 7 or 10 bit addresss of slave to send to
 * 	- sr: boolean for if this should be a repeated start
 * Return: State of the I2C from @I2C_AppStates
 */
uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr){
	uint8_t busystate  = pI2CHandle->TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pTxBuffer = pTxBuffer;
		pI2CHandle->TxLen = len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DevAddr = slaveAddr;
		pI2CHandle->Sr = sr;

		//Generate START Condition
		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		//Enable ITBUFEN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);

		//Enable ITEVTEN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);

		//Enable ITERREN Control Bit
		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
	}

	return busystate;
}

/* Function Name: I2C_MasterReceiveDataIT
 * Desc: Read from I2C port with provided slave address and to RxBuffer in nonblocking mode.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * 	- pRxBuffer: Pointer to a buffer array to write to
 * 	- len: Total bytes to write to RxBuffer
 * 	- slaveAddr: 7 or 10 bit addresss of slave to send to
 * 	- sr: boolean for if this should be a repeated start
 * Return: State of the I2C from @I2C_AppStates
 */
uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t len, uint8_t slaveAddr, uint8_t sr){
	uint8_t busystate = pI2CHandle->TxRxState;

		if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
		{
			pI2CHandle->pRxBuffer = pRxBuffer;
			pI2CHandle->RxLen = len;
			pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
			pI2CHandle->RxSize = len; //Rxsize is used in the ISR code to manage the data reception
			pI2CHandle->DevAddr = slaveAddr;
			pI2CHandle->Sr = sr;
			//Generate START Condition
				I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

			//Enable ITBUFEN Control Bit
			pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);

