devinschubert14/STM410RB-Drivers/drivers/drivers/Src/stm32f410RB_i2c_driver.c
			//Enable ITEVTEN Control Bit
			pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);

			//Enable ITERREN Control Bit
			pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);

		}

		return busystate;
}

/***********************************************************
 *
 * 				IRQ Config and Priority
 *
 ***********************************************************/

/* Function Name: I2C_IRQInterruptConfig
 * Desc: Enable/Disable interrupts on NVIC.
 * Params:
 * 	- IRQNumber: Numbered pin 1-96 to enable/disable in NVIC
 * 	- EnOrDI: ENABLE/DISABLE or 0/1
 * Return: None */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		if(IRQNumber <= 31)
		{
			//program ISER0 register
			*NVIC_ISER0 |= ( 1 << IRQNumber );

		}else if(IRQNumber > 31 && IRQNumber < 64 ) //32 to 63
		{
			//program ISER1 register
			*NVIC_ISER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 64 && IRQNumber < 96 )
		{
			//program ISER2 register //64 to 95
			*NVIC_ISER3 |= ( 1 << (IRQNumber % 64) );
		}
	}else
	{
		if(IRQNumber <= 31)
		{
			//program ICER0 register
			*NVIC_ICER0 |= ( 1 << IRQNumber );
		}else if(IRQNumber > 31 && IRQNumber < 64 )
		{
			//program ICER1 register
			*NVIC_ICER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 6 && IRQNumber < 96 )
		{
			//program ICER2 register
			*NVIC_ICER3 |= ( 1 << (IRQNumber % 64) );
		}
	}
}

/* Function Name: I2C_IRQPriorityConfig
 * Desc: Configure priority level of IRQ number provided.
 * Params:
 * 	- IRQNumber: Numbered pin 1-96 to set priority of interrupt in NVIC
 * 	- IRQPriority: Priority number for interrupt
 * Return: None
 */
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	//1. Calculate ipr register and section
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section  = IRQNumber %4 ;

	uint8_t shift_amount = ( 8 * iprx_section) + ( 8 - NO_PR_BITS_IMPLEMENTED) ;

	*(  NVIC_PR_BASE_ADDR + iprx ) |=  ( IRQPriority << shift_amount );
}

/***********************************************************
 *
 * 		I2C Interrupt Helper Functions
 *
 ***********************************************************/

/* Function Name: I2C_MasterHandleTXEInterrupt
 * Desc: Interrupt handler for writing from TxBuffer to data register.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None
 */
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle){
	if(pI2CHandle->TxLen > 0){
		//Load data into DR
		pI2CHandle->pI2Cx->DR = *(pI2CHandle->pTxBuffer);
		//decrement the len
		pI2CHandle->TxLen--;
		//increment buffer address
		pI2CHandle->pTxBuffer++;
	}
}

/* Function Name: I2C_MasterHandleRXNEInterrupt
 * Desc: Interrupt handler for reading from data register to RX buffer.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None
 */
static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle){
	if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX){
		if(pI2CHandle->RxSize == 1){
			*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
			pI2CHandle->RxLen--;
		}


		if(pI2CHandle->RxSize > 1){

			//Disable ACK
			if(pI2CHandle->RxLen == 2){
				I2C_ManageAcking(pI2CHandle->pI2Cx, DISABLE);
			}

			//read DR
			*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
			pI2CHandle->pRxBuffer++;
			pI2CHandle->RxLen--;
		}

		if(pI2CHandle->RxLen == 0){
			//close the I2C data reception and notify application

			//1. Generate STOP condition
			if(pI2CHandle->Sr == I2C_DISABLE_SR)
				I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

			//2. Close the I2C rx
			I2C_CloseReceiveData(pI2CHandle);

			//3. Notify the application
			I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_RX_CMPLT);
		}
	}
}

/* Function Name: I2C_EV_IRQHandling
 * Desc: Calls interrupt handler for I2C port events.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None
 */
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle){
	//Interrupt handling for both master and slave mode


	uint32_t temp1, temp2, temp3;

	temp1 = pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR2_ITEVTEN);
	temp2 = pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_ITBUFEN);

	//1. Handle the interrupt generated by SB event
	temp3 = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_SB);

	if(temp1 && temp3){
		//SB flag is set
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX){
			I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);
		}else if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX){
			I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);
		}
	}

	//2. Handle interrupt for address event
	temp3 = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_ADDR);

	if(temp1 && temp3){
		//ADDR flag is set
		I2C_ClearADDRFlag(pI2CHandle);
	}

	//3. Handle the interrupt for BTF (Byte Transfer Finished) event
	temp3 = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_BTF);

	if(temp1 && temp3){
		//BTF flag is set
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX){
			if(pI2CHandle->pI2Cx->SR1 & (1 << I2C_SR1_TXE)){
				//BTF, TXE = 1
				if(pI2CHandle->TxLen == 0){
					//1. generate STOP condition
					if(pI2CHandle->Sr == I2C_DISABLE_SR)
						I2C_GenerateStartCondition(pI2CHandle->pI2Cx);
					//2. reset all member elements of handle structure
					I2C_CloseSendData(pI2CHandle);
					//3. notify the application about transmission complete
					I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_TX_CMPLT);
				}
			}
		}
		else if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX){
			;
		}
	}

	//4. Handle interrupt for STOPF event
	temp3 = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_STOPF);

	if(temp1 && temp3){
		//STOPF flag is set
		//Clear the STOPF
		pI2CHandle->pI2Cx->CR1 |= 0x0000;

		//Notify application
		I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_STOP);
	}

