devinschubert14/STM410RB-Drivers/drivers/drivers/Src/stm32f410RB_i2c_driver.c
	//5. Handle interrupt for TXE event
	temp3 = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_TXE);

	if(temp1 && temp2 && temp3){
		//TXE flag is set
		if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_MSL)){
			//Master mode
			if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX){
				I2C_MasterHandleTXEInterrupt(pI2CHandle);
			}
		}
		else{
			//Slave mode
			if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_TRA)){
				I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_REQ);
			}
		}
	}

	//6. Handle interrupt for RXNE event
	temp3 = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_RXNE);

	if(temp1 && temp2 && temp3){
		//RXNE flag is set
		if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_MSL)){
			//Master Mode
			I2C_MasterHandleRXNEInterrupt(pI2CHandle);
		}
		else{
			if(!(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_TRA))){
				I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_RCV);
			}
		}
	}
}

/* Function Name: I2C_ER_IRQHandling
 * Desc: Calls interrupt handler for I2C port errors.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None
 */
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle){
	uint32_t statusITERREN = (pI2CHandle->pI2Cx->SR1) & (1 << I2C_SR1_BERR);

	//Bus Error
	uint32_t statusBERR = (pI2CHandle->pI2Cx->SR1) & (1 << I2C_SR1_BERR);
	if(statusITERREN && statusBERR){
		//Clear error flag
		(pI2CHandle->pI2Cx->SR1) &= ~(1 << I2C_SR1_BERR);

		//Notify application
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_BERR);
	}


	//Arbitration error
	uint32_t statusARLO = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_ARLO );
	if(statusARLO  && statusITERREN)
	{
		//Clear error flag
		(pI2CHandle->pI2Cx->SR1) &= ~( 1 << I2C_SR1_ARLO );

		//Notify application
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_ARLO);
	}

	//ACK failure
	uint32_t statusAF = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_AF);
	if(statusAF  && statusITERREN)
	{
		//Clear error flag
		(pI2CHandle->pI2Cx->SR1) &= ~( 1 << I2C_SR1_AF );

		//Implement the code to notify the application about the error
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_AF);
	}

	//Overrun/underrun error
	uint32_t statusOVR = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_OVR);
	if(statusOVR  && statusITERREN)
	{
		//Clear error flag
		(pI2CHandle->pI2Cx->SR1) &= ~( 1 << I2C_SR1_OVR );

		//Notify application
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_OVR);
	}

	//Overrun/underrun error
	uint32_t statusTO= (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_TIMEOUT);
	if(statusTO  && statusITERREN)
	{
		//Clear error flag
		(pI2CHandle->pI2Cx->SR1) &= ~( 1 << I2C_SR1_TIMEOUT );

		//Notify application
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_TIMEOUT);
	}
}

/***********************************************************
 *
 * 			Flag Functions
 *
 ***********************************************************/

/* Function Name: I2C_GetFlagStatus
 * Desc: Returns flag status of provided @I2C_Flags.
 * Params:
 * 	-*pI2Cx: I2C port from @I2C_BASEADDR.
 * 	-flagName: Flag macro from @I2C_Flags
 * Return: None
 */
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t flagName)
{
	if (pI2Cx->SR1 & flagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}

/***********************************************************
 *
 * 			Helper Functions
 *
 ***********************************************************/

/* Function Name:  I2C_CloseReceiveData
 * Desc: Resets I2C Handle receiving information to default and enables ACKing.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None */
void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle){
	//Disable ITBUFEN control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);

	//Disable ITEVFEN control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
	pI2CHandle->RxLen = 0;
	pI2CHandle->RxSize = 0;

	if(pI2CHandle->I2C_Config.I2C_AckControl == I2C_ACK_ENABLE){
		I2C_ManageAcking(pI2CHandle->pI2Cx, ENABLE);
	}
}

/* Function Name:  I2C_CloseReceiveData
 * Desc: Resets I2C Handle transmitting information to default.
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * Return: None */
void I2C_CloseSendData(I2C_Handle_t *pI2CHandle){
	//Disable ITBUFEN control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);

	//Disable ITEVFEN control bit
	pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
}

/* Function Name:  I2C_SlaveEnableDisableCallbackEvents
 * Desc: Enables or disables callback events when in slave mode.
 * Params:
 * 	-*pI2Cx: I2C port from @I2C_BASEADDR.
 * 	- EnOrDi: ENABLE/DISABLE or 1/0 respectively.
 * Return: None */
void I2C_SlaveEnableDisableCallbackEvents(I2C_RegDef_t *pI2Cx,uint8_t EnorDi){
	if(EnorDi == ENABLE){
		pI2Cx->CR2 |= (1 << I2C_CR2_ITEVTEN);
		pI2Cx->CR2 |= (1 << I2C_CR2_ITBUFEN);
		pI2Cx->CR2 |= (1 << I2C_CR2_ITERREN);
	}
	else{
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITERREN);
	}
}

/* Function Name:  I2C_ApplicationEventCallback
 * Desc: Weak prototype to be overwritten by programmer and will be called
 * whenever an applicaton event stated in @I2C_AppEvents occurs
 * Params:
 * 	-*pI2CHandle: A handler for the configuration settings and base address of I2C port.
 * 	- AppEv: Interrupt that was called from I2C port in handle. Events are provided in @I2C_AppEvents.
 * Return: None */
__attribute__((weak)) void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{
	// Application implemented
}
